In [4]:
import pandas as pd
var = pd.DataFrame({"A":[1,2,3,4,5],"B":[1,2,3,4,5]})
var.insert(1,"Python",var["A"])
var.insert(2,"python",[12,23,34,54,65])
var

   A  Python  python  B
0  1       1      12  1
1  2       2      23  2
2  3       3      34  3
3  4       4      54  4
4  5       5      65  5

In [10]:
var["python_12"]=var["A"][:3]
var

   A  Python  python  python_12
0  1       1      12        1.0
1  2       2      23        2.0
2  3       3      34        3.0
3  4       4      54        NaN
4  5       5      65        NaN

In [9]:
var2 = var.pop("B")
print(var2)

0    1
1    2
2    3
3    4
4    5
Name: B, dtype: int64

In [11]:
del var["A"]
var

   Python  python  python_12
0       1      12        1.0
1       2      23        2.0
2       3      34        3.0
3       4      54        NaN
4       5      65        NaN